In [1]:
import pandas as pd

In [ ]:
series = pd.Series(["BMW", "Maruti"])
series

In [ ]:
car_data = pd.DataFrame({"Car Make": series})
car_data

In [ ]:
colors = pd.Series(["Red", "Blue"])

In [ ]:
car_data = pd.DataFrame({"Car Make": series, "Color": colors})
car_data

In [32]:
car_sales = pd.read_csv("car-sales_duplicate.csv")

In [33]:
car_sales

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043    4.0  $4,000.00
1   Honda    Red          87899    NaN        NaN
2  Toyota   Blue          32549    3.0  $7,000.00
3     BMW  Black          11179    NaN        NaN
4  Nissan  White         213095    4.0  $3,500.00
5  Toyota  Green          99213    4.0  $4,500.00
6   Honda   Blue          45698    4.0  $7,500.00
7   Honda   Blue          54738    4.0  $7,000.00
8  Toyota  White          60000    4.0  $6,250.00
9  Nissan  White          31600    4.0  $9,700.00

## Describe Data

In [45]:
# Attribute
car_sales.dtypes

Make              object
Colour            object
Odometer (KM)      int64
Doors            float64
Price            float64
Seats            float64
dtype: object

In [ ]:
car_columns = car_sales.columns
car_columns

In [ ]:
car_sales.index

In [ ]:
print("'hello9' world")

In [ ]:
help

In [ ]:
help(car_sales)

In [ ]:
car_sales.describe()

In [ ]:
car_sales.info()

In [ ]:
car_sales.loc[4]

In [ ]:
car_sales[car_sales["Odometer (KM)"] > 100000]

In [ ]:
car_sales["Odometer (KM)"].hist()

## Manipulating Data

In [3]:
car_sales['Make'].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [4]:
car_sales['Make'] = car_sales['Make'].str.lower()

In [5]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  toyota  White         150043      4   $4,000.00
1   honda    Red          87899      4   $5,000.00
2  toyota   Blue          32549      3   $7,000.00
3     bmw  Black          11179      5  $22,000.00
4  nissan  White         213095      4   $3,500.00
5  toyota  Green          99213      4   $4,500.00
6   honda   Blue          45698      4   $7,500.00
7   honda   Blue          54738      4   $7,000.00
8  toyota  White          60000      4   $6,250.00
9  nissan  White          31600      4   $9,700.00

In [7]:
car_sales.isnull().sum()

Make             0
Colour           0
Odometer (KM)    0
Doors            0
Price            0
dtype: int64

In [34]:
car_sales['Price'] = car_sales['Price'].fillna(car_sales['Price'].mean())

TypeError: can only concatenate str (not "int") to str

In [37]:
car_sales['Doors'] = car_sales['Doors'].fillna(car_sales['Doors'].mean())

In [36]:
car_sales

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043  4.000  $4,000.00
1   Honda    Red          87899  3.875        NaN
2  Toyota   Blue          32549  3.000  $7,000.00
3     BMW  Black          11179  3.875        NaN
4  Nissan  White         213095  4.000  $3,500.00
5  Toyota  Green          99213  4.000  $4,500.00
6   Honda   Blue          45698  4.000  $7,500.00
7   Honda   Blue          54738  4.000  $7,000.00
8  Toyota  White          60000  4.000  $6,250.00
9  Nissan  White          31600  4.000  $9,700.00

In [38]:
car_sales['Price'] = car_sales['Price'].replace({'\$':'', ',':''}, regex=True).astype(float)

<>:1: SyntaxWarning: invalid escape sequence '\$'
<>:1: SyntaxWarning: invalid escape sequence '\$'
/var/folders/6l/9g6t4kp90gn4973plz_3k_c00000gn/T/ipykernel_86456/1813134923.py:1: SyntaxWarning: invalid escape sequence '\$'
  car_sales['Price'] = car_sales['Price'].replace({'\$':'', ',':''}, regex=True).astype(float)

In [39]:
car_sales

     Make Colour  Odometer (KM)  Doors   Price
0  Toyota  White         150043  4.000  4000.0
1   Honda    Red          87899  3.875     NaN
2  Toyota   Blue          32549  3.000  7000.0
3     BMW  Black          11179  3.875     NaN
4  Nissan  White         213095  4.000  3500.0
5  Toyota  Green          99213  4.000  4500.0
6   Honda   Blue          45698  4.000  7500.0
7   Honda   Blue          54738  4.000  7000.0
8  Toyota  White          60000  4.000  6250.0
9  Nissan  White          31600  4.000  9700.0

In [40]:
car_sales['Price'].fillna(car_sales['Price'].mean(), inplace=True)

/var/folders/6l/9g6t4kp90gn4973plz_3k_c00000gn/T/ipykernel_86456/4278658696.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  car_sales['Price'].fillna(car_sales['Price'].mean(), inplace=True)

In [41]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043  4.000  4000.00
1   Honda    Red          87899  3.875  6181.25
2  Toyota   Blue          32549  3.000  7000.00
3     BMW  Black          11179  3.875  6181.25
4  Nissan  White         213095  4.000  3500.00
5  Toyota  Green          99213  4.000  4500.00
6   Honda   Blue          45698  4.000  7500.00
7   Honda   Blue          54738  4.000  7000.00
8  Toyota  White          60000  4.000  6250.00
9  Nissan  White          31600  4.000  9700.00

In [48]:
seats_column = pd.Series([5,4,4,8,7,5,4,4,8,7])
car_sales['Seats'] = seats_column
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  Toyota  White         150043  4.000  4000.00      5
1   Honda    Red          87899  3.875  6181.25      4
2  Toyota   Blue          32549  3.000  7000.00      4
3     BMW  Black          11179  3.875  6181.25      8
4  Nissan  White         213095  4.000  3500.00      7
5  Toyota  Green          99213  4.000  4500.00      5
6   Honda   Blue          45698  4.000  7500.00      4
7   Honda   Blue          54738  4.000  7000.00      4
8  Toyota  White          60000  4.000  6250.00      8
9  Nissan  White          31600  4.000  9700.00      7

In [50]:
car_sales['Seats'].fillna(5, inplace=True)

/var/folders/6l/9g6t4kp90gn4973plz_3k_c00000gn/T/ipykernel_86456/2918933627.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  car_sales['Seats'].fillna(5, inplace=True)

In [44]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  Toyota  White         150043  4.000  4000.00    5.0
1   Honda    Red          87899  3.875  6181.25    4.0
2  Toyota   Blue          32549  3.000  7000.00    4.0
3     BMW  Black          11179  3.875  6181.25    8.0
4  Nissan  White         213095  4.000  3500.00    7.0
5  Toyota  Green          99213  4.000  4500.00    5.0
6   Honda   Blue          45698  4.000  7500.00    5.0
7   Honda   Blue          54738  4.000  7000.00    5.0
8  Toyota  White          60000  4.000  6250.00    5.0
9  Nissan  White          31600  4.000  9700.00    5.0

In [51]:
fuel_economy = [7.5, 9.2, 2.3, 4.5, 7.6,7.5, 9.2, 2.3, 4.5, 7.6]
car_sales['Fuel per 100km'] = fuel_economy
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats  Fuel per 100km
0  Toyota  White         150043  4.000  4000.00      5             7.5
1   Honda    Red          87899  3.875  6181.25      4             9.2
2  Toyota   Blue          32549  3.000  7000.00      4             2.3
3     BMW  Black          11179  3.875  6181.25      8             4.5
4  Nissan  White         213095  4.000  3500.00      7             7.6
5  Toyota  Green          99213  4.000  4500.00      5             7.5
6   Honda   Blue          45698  4.000  7500.00      4             9.2
7   Honda   Blue          54738  4.000  7000.00      4             2.3
8  Toyota  White          60000  4.000  6250.00      8             4.5
9  Nissan  White          31600  4.000  9700.00      7             7.6

In [52]:
car_sales['Total fuel used'] = car_sales['Odometer (KM)']/100 * car_sales['Fuel per 100km']
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100km,Total fuel used
0,Toyota,White,150043,4.000,4000.00,5,7.5,11253.225
1,Honda,Red,87899,3.875,6181.25,4,9.2,8086.708
2,Toyota,Blue,32549,3.000,7000.00,4,2.3,748.627
3,BMW,Black,11179,3.875,6181.25,8,4.5,503.055
4,Nissan,White,213095,4.000,3500.00,7,7.6,16195.220
5,Toyota,Green,99213,4.000,4500.00,5,7.5,7440.975
6,Honda,Blue,45698,4.000,7500.00,4,9.2,4204.216
7,Honda,Blue,54738,4.000,7000.00,4,2.3,1258.974
8,Toyota,White,60000,4.000,6250.00,8,4.5,2700.000
9,Nissan,White,31600,4.000,9700.00,7,7.6,2401.600

In [54]:
%%timeit
car_sales.drop("Total fuel used", axis=1)

64 s  329 ns per loop (mean  std. dev. of 7 runs, 10,000 loops each)

In [ ]:
car_sales.drop